## Data Integration

In [2]:
import pandas as pd
import numpy as np

In [3]:
#menggabungkan data
kota = pd.DataFrame({'Nama': ['Adi','Budi','Cinta','Dani'],
                     'JK': ['L', 'L', 'P', 'L'],
                     'Asal' : ['SBY', 'JKT', 'BWI', 'BDG']})
toefl = pd.DataFrame({'Nama': ['Adi','Budi','Cinta','Dani'],
                      'Toefl': ['450', '455', '480', '500'],
                      'Ket.' : ['Tidak Lulus', 'Tidak Lulus', 'Lulus', 'Lulus']})
result1 = pd.merge(kota, toefl, on='Nama')
result1

    Nama JK Asal Toefl         Ket.
0    Adi  L  SBY   450  Tidak Lulus
1   Budi  L  JKT   455  Tidak Lulus
2  Cinta  P  BWI   480        Lulus
3   Dani  L  BDG   500        Lulus

In [9]:
#mengganti urutan kolom
result1 = result1[['Nama', 'Asal', 'JK', 'Toefl', 'Ket.']]
result1

    Nama Asal JK Toefl         Ket.
0    Adi  SBY  L   450  Tidak Lulus
1   Budi  JKT  L   455  Tidak Lulus
2  Cinta  BWI  P   480        Lulus
3   Dani  BDG  L   500        Lulus